In [3]:
import pandas as pd
import numpy as np

In [7]:
df=pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[3,6,8,23],[23,23,63,12]])

In [8]:
df.head()

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [13]:
df.shape

(5, 4)

In [14]:
df.iloc[0,1]#Access one element

2

In [15]:
df.iloc[0:2,0:2] # slicing of data frame without using for but using inbuilt iloc function

   0  1
0  1  2
1  5  6

In [ ]:
# Aap insure kre ki aapka programs built in fn use kre h kyoki unki speed incredible hoti h
# search -- panda how to do in google for knowing built in functions

In [16]:
# Columns
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[3,6,8,23],[23,23,63,12]],columns=['A','B','C','D'])

In [17]:
df1 # A B C D is here as column name. You can make headers.

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [30]:
#REading CSV files
dff=pd.read_csv('data.csv')

In [31]:
dff.head()

  Username; Identifier;First name;Last name
0               booker12;9012;Rachel;Booker
1                    grey07;2070;Laura;Grey
2              johnson81;4081;Craig;Johnson
3               jenkins46;9346;Mary;Jenkins
4                  smith79;5079;Jamie;Smith

In [ ]:
#dtype . you should insure your headers has no space anywhere
print(dff['Identifier'].dtype)

In [ ]:
print(dff['Username'].dtype)

In [ ]:
print(dff['Username'].astype)